{"posts":[{"title":"3.27日常更新","text":"最近学习情况 这周在匆忙中度过，有两天给老师做事情，无心学习，不做事情的时候要上课，无心学习。 综上，本周无心学习。不过还有周六周日两天，希望能集中精力多学会。 打游戏 最近每天都上线玩《鸣潮》，有很多喜欢的角色但是资源不够，很纠结，想要直接买号，但是又想着找到实习后赚了钱再买，这种想法对么？ 实习啊实习，希望面试跟“旷课“都能顺利些。 心路历程 最近一直在看一本《心理控制术》的书，里面讲的许多还挺受用，作者所提出的”自我意象“的概念让我觉得有点熟悉，所谓的”自我意象“即你心里对自己的评价与印象，你在现实生活的反应都是基于自我意象，你可以塑造更好的自我意象实现更好的未来，听着满玄乎的。 感觉有点像大学的期末考试，明知道最后不会挂科但是还是要在期末周努力学习。仔细想想应该是先塑造了不会挂科的自我意象，然后通过努力学习使得现实中的自己跟自我意象更加接近了。 还有一个经历是我自己一直自我评价我的数学不是很好，就是学的不是很快，面对数学题脑子转的不快但是只要时间足够依旧能学会，这是我以前为自己设定的自我意象。设定后仿佛现实生活中遇到数学难题都在证明我的自我意象的准确，从而加深自我意象，现在想想这真是太错误了，分明就是给自己设了限制。幸好我还一直坚信应试考试不需要天赋就能得到还不错的成绩，让我高考跟考研数学都没有很差。 所以，不要给轻易自己设限，要树立一个符合实际又强大的自我意象。","link":"/2025/03/21/3.21/"},{"title":"3.27日常更新","text":"最近学习情况 准备面试了，八股文粗略的看了一遍，sql刷了50道题，算法题只刷了三四十题（感觉找小厂日常实习不太用得到那么多算法）。 简历上现在只有一个项目，苍穹外卖跟黑马点评的结合，打算再俗称一个轮子项目手写RPC框架，听说这个项目就是轮子界的苍穹外卖，只能做这些烂大街的项目了。 对于面试还有有点慌的，毕竟还没有工作面试过，希望能顺利一点。接下来应该就会增加更新频率了，顺利的话会更新面经。","link":"/2025/04/12/4.12/"},{"title":"Hello World!","text":"Welcome come to my blog! 为什么做博客？做博客的想法从大三就已经有了，当时正在学javaweb就萌生了做博客的想法，可惜没有坚持下去，甚至javaweb的课程都没有学完。 时间匆匆，已经到了研一，昨日看一位大佬的个人博客网站心血来潮右捡起了做博客的想法，想着现在AI技术这么成熟了，就算我不怎么会前端应该也能做出比较精美的页面。说做就做！ 没想到现在做博客这么简单了，直接使用Hexo就可以直接部署，还有现成的博客模板提供使用，用了一个下午就搭建好了，完全用不到后端知识，前端也直接用现成的模板，没想到这么轻松。 接下来的安排完善博客的各种功能吧，例如评论功能，音乐功能，分享功能等等，找一些像素风的二次元人物美化下我的网站。","link":"/2025/03/12/hello-world/"},{"title":"(持续更新)Hexo的icarus主题配置攻略与注意事项","text":"总结一下在完善博客功能时遇到的坑 icarus相关文件的位置 老版本的icarus的相关文件都会放在Blog\\themes\\icarus\\的目录下，但是现在新版本的配置文件直接就放在\\Blog\\目录下，themes文件夹为空，其他相关配置在\\Blog\\node_modules\\hexo-theme-icarus这个目录 如果对默认格式不满意，需要去\\Blog\\node_modules\\hexo-theme-icarus找相关的文件修改源代码，一般是.jsx文件 部署成功后默认的当前工作目录是\\Blog\\source，所以你可以在这个目录下新建一个img文件夹存放用到的图片，这样使用到图片时相对路径就是\\img\\XXX.jpg 评论插件 本站使用的是Twikoo评论系统，具体部署流程参考官方文档，一共是两个部署步骤，云部署与本地配置文件设置，本地配置时需要注意： env_id就是云部署完成后你自己可以访问通过的网络链接地址 评论相关设置不在本地文件中，而在博客评论界面有一个小齿轮按钮（别像我一样在本地找了半天） 如果要修改Twikoo前端版本，需要修改\\Blog\\node_modules\\hexo-component-inferno\\lib\\view\\comment 这个目录下的相关js文件，注意是hexo-component-inferno（太坑人了） 同时推荐使用 Qmsg酱，接入 Twikoo 后有新的访客评论时可以直接在🐧收到推送。 —————————————————————————–2025/4/12更新——————————————————————————- 一直想用smms做一个图床，这样在博客中上传图片就可以上传到图床中，这样相比直接在博客文档中插入图片对github服务器的压力小很多，但是最开始的时候smms网站的注册服务网页有问题，我邮件联系了管理员后过了一段时间发现他们竟然直接暂停了注册服务，这下不知道什么时候才能恢复了。","link":"/2025/03/15/hexo%E6%94%BB%E7%95%A5/"}],"tags":[{"name":"life","slug":"life","link":"/tags/life/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Icarus","slug":"Icarus","link":"/tags/Icarus/"}],"categories":[{"name":"日常碎碎念","slug":"日常碎碎念","link":"/categories/%E6%97%A5%E5%B8%B8%E7%A2%8E%E7%A2%8E%E5%BF%B5/"},{"name":"hexo攻略","slug":"hexo攻略","link":"/categories/hexo%E6%94%BB%E7%95%A5/"}],"pages":[{"title":"关于我，关于lifeme02","text":"Hi，欢迎来到我的频道！ 为什么做博客？ 做博客的想法从大三就已经有了，当时正在学javaweb就萌生了做博客的想法，可惜没有坚持下去，甚至javaweb的课程都没有学完。 时间匆匆，已经到了研一，昨日看一位大佬的个人博客网站心血来潮右捡起了做博客的想法，想着现在AI技术这么成熟了，就算我不怎么会前端应该也能做出比较精美的页面。说做就做！ 没想到现在做博客这么简单了，直接使用Hexo就可以直接部署，还有现成的博客模板提供使用，用了一个下午就搭建好了，完全用不到后端知识，前端也直接用现成的模板，没想到这么轻松。 关于我的一些信息 男生，22岁 计算机硕士在读 喜欢游戏、二次元、跑步 在lifeme02你可以看到 算法刷题记录 Java开发岗面试记录 读书感悟与推荐 日常碎碎念 PS: 本站部分素材来自网络，不做商用，侵权删除。","link":"/about.html"},{"title":"分类","text":"damn","link":"/categories/index.html"}]}